stm32-hotspot/STM32WBA-Advanced-BLE-Broadcast-Speaker/Utilities/Terminal/stm32_term.c
/**
******************************************************************************
* @file    stm32_term.c
* @author  MCD Application Team
* @brief   Manage terminal communication
******************************************************************************
* @attention
*
* Copyright (c) 2022(-2022) STMicroelectronics.
* All rights reserved.
*
* This software is licensed under terms that can be found in the LICENSE file
* in the root directory of this software component.
* If no LICENSE file comes with this software, it is provided AS-IS.
*
******************************************************************************
*/

/* Includes ------------------------------------------------------------------*/
#include <stdarg.h>
#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include <ctype.h>
#include "stm32_term.h"
#include "stm32_term_tasks.h"

/* Global variables ----------------------------------------------------------*/

/* Private defines -----------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
#define UTIL_TERM_KEY_DEL          ((char)0x7FU)        /* teraterm send 7F rather than an "ESC[3~"*/
#define UTIL_TERM_KEY_ESC_KEYBOARD ((char)0xFEU)
#define UTIL_TERM_KEY_ESC          ((char)0x1BU)
#define UTIL_TERM_KEY_BACK         ((char)0x08U)
#define UTIL_TERM_KEY_UP           "[A"
#define UTIL_TERM_KEY_DN           "[B"
#define UTIL_TERM_KEY_LF           "[D"
#define UTIL_TERM_KEY_RG           "[C"
#define UTIL_TERM_KEY_END          "[4~"
#define UTIL_TERM_KEY_HOME         "[1~"
#define UTIL_TERM_KEY_DEL_CSI      "[3~"
#define UTIL_TERM_KEY_INSERT       "[2~"
#define UTIL_TERM_KEY_BEL          "\x7"
#ifndef UTIL_TERM_SIZE_HISTORY
  #define UTIL_TERM_SIZE_HISTORY    5U
#endif
#define UTIL_CHAR_EOF               0xF0U
#ifndef UTIL_TERM_PROMPT_PROLOGUE
  #define UTIL_TERM_PROMPT_PROLOGUE "cli> "
#endif
/* Private typedef -----------------------------------------------------------*/
/* key overload for Csi support */
typedef struct key_support_cb
{
  uint8_t maxHistory;
  void (*add_history)(void);
  void (*add_char_at_position)(char theChar);
  void (*set_cursor_pos)(uint32_t pos);
  bool (*is_key_del_char)(char theChar);
  bool (*is_key_escape)(char theChar);
  bool (*is_key_enter_exit_cli)(char theChar);
  bool (*is_key_back)(char theChar);
  bool (*is_key_csi)(void);
} key_support_cb;
static const key_support_cb cKeySupport;

/* Private variables ---------------------------------------------------------*/
static UTIL_TERM_t *gContext;

/* Private function prototypes -----------------------------------------------*/
static void                             s_enable_cli(uint8_t bEnable);
static void                             s_rx_error_cb(UART_HandleTypeDef *pHdleUart);
static void                             s_dma_uart_event_cb(struct __UART_HandleTypeDef *huart, uint16_t Pos);
static bool                             s_search_end_of_word(char **const ppLine, const char end_of_word_char);
static void                             s_do_line_cmd(char *pLine);
static UTIL_TERM_cmd_str_entry_t const *s_find_entry(char *command);
static void                             s_dma_uart_rx_half_cb(struct __UART_HandleTypeDef *huart);
static void                             s_dma_uart_rx_cpl_cb(struct __UART_HandleTypeDef *huart);

/* Allocator overload */
static UTIL_TERM_realloc_t s_realloc = (UTIL_TERM_realloc_t)realloc;
static UTIL_TERM_free_t    s_free    = (UTIL_TERM_free_t)free;



/* Functions Definition ------------------------------------------------------*/

__weak void UTIL_TERM_cycleMeasure_Init(void)
{
}


__weak void UTIL_TERM_cycleMeasure_Reset(void)
{
}


__weak void UTIL_TERM_cycleMeasure_Start(void)
{
}


__weak void UTIL_TERM_cycleMeasure_Stop(void)
{
}


/**
* @brief Terminal init
*
*/

/**
* @brief Return the cli buffer
* @param index history buffer
*
*/
static char *UTIL_TERM_get_cli_buffer(uint32_t index)
{
  return &gContext->pBuffer[index * gContext->lenBuffer];
}


/**
* @brief Overload allocator functions
*
* @param pRealloc callback realloc
* @param pFree callback free
*/
void UTIL_TERM_set_alloc_funcs(UTIL_TERM_realloc_t pRealloc, UTIL_TERM_free_t pFree)
{
  s_realloc = pRealloc;
  s_free = pFree;
}



#ifdef UTIL_TERM_USE_CSI

/**
 * @brief Insert a char in the current buffer
 *
 * @param theChar
 */
static void s_csi_insert_char(char theChar)
{
  uint32_t lenMove = gContext->lenBuffer - gContext->iPosCursor - 1U;
  memmove(&UTIL_TERM_get_cli_buffer(0)[gContext->iPosCursor + 1U], &UTIL_TERM_get_cli_buffer(0)[gContext->iPosCursor], lenMove);
  UTIL_TERM_get_cli_buffer(0)[gContext->iPosCursor] = theChar;
  gContext->iPosCursor++;
  char strChar[6] = {'\x1B', '[', '1', '@', theChar, '\0'};
  UTIL_TERM_puts(strChar); /* echo on the console  */
}


/**
 * @brief  Insert a char in the cursor position
 *
 * @param theChar
 */
static void s_csi_add_char_at_position(char theChar)
{
  if (gContext->iPosCursor < (gContext->lenBuffer - 1U))
  {
    /* if the char is ascii, add it to the Cli buffer */
    if ((theChar >= ' ') && (theChar <= (char)127U))
    {
      s_csi_insert_char(theChar);
    }
  }
  else
  {
    UTIL_TERM_puts(UTIL_TERM_KEY_BEL);
  }
}


/**
 * @brief Set the cursor to a specific position in the line
 *
 * @param pos
 */
static void s_csi_set_cursor_pos(uint32_t pos)
{
  gContext->iPosCursor = pos;
  char tChar[10];
  snprintf(tChar, sizeof(tChar) - 1U, "\x1B[%d`", 1U + pos + strlen(UTIL_TERM_PROMPT_PROLOGUE));
  UTIL_TERM_puts(tChar);
}


/**
 * @brief Check the Key DEL and do the action
 *
 * @param theChar
 * @return false
 */

static bool s_csi_is_key_del_char(char theChar)
{
  bool bDone = false;
  if ((gContext->bCliEnable == TRUE) && (theChar == UTIL_TERM_KEY_DEL))
  {
    if (gContext->iPosCursor < strlen(UTIL_TERM_get_cli_buffer(0)))
    {
      uint32_t szMove = gContext->lenBuffer - gContext->iPosCursor - 1U;
      memmove(UTIL_TERM_get_cli_buffer(0), UTIL_TERM_get_cli_buffer(0) + 1, szMove);
      cKeySupport.set_cursor_pos(gContext->iPosCursor);
      UTIL_TERM_puts("\x1B[1P"); /* delete char */
    }
    else
    {
      UTIL_TERM_puts(UTIL_TERM_KEY_BEL);
    }
    bDone = true;
  }
  return bDone;
}


/**
 * @brief Check the Key BACK  and do the action
 *
 * @param theChar
 * @return false
 */
static bool s_csi_is_key_back(char theChar)
{
  bool bDone = false;
  if ((gContext->bCliEnable == true) && (theChar == UTIL_TERM_KEY_BACK))
  {
    /* check the backspace and remove the last char */
    if (gContext->iPosCursor)
    {
      uint32_t lenLine = strlen(UTIL_TERM_get_cli_buffer(0)) + 1U; /* +1 for the 0 */
      gContext->iPosCursor--;                                     /* remove previous char */
      memmove(UTIL_TERM_get_cli_buffer(0) + gContext->iPosCursor, UTIL_TERM_get_cli_buffer(0) + gContext->iPosCursor + 1U, lenLine - gContext->iPosCursor - 1U);
      cKeySupport.set_cursor_pos(gContext->iPosCursor);
      UTIL_TERM_puts("\x1B[1P"); /* delete char */
    }
    else
    {
      UTIL_TERM_puts(UTIL_TERM_KEY_BEL);
    }

    bDone = true;
  }
  return bDone;
}


/**
 * @brief Check and manage a CSI sequence, mainly ARROWS
 *
 * @param theChar
 * @return false
 */
static bool s_csi_check_key(void)
{
  bool bDone = true;

  if (strcmp(gContext->tCsi, UTIL_TERM_KEY_HOME) == 0)
  {
    cKeySupport.set_cursor_pos(0);
  }
  else if (strcmp(gContext->tCsi, UTIL_TERM_KEY_END) == 0)
  {
    cKeySupport.set_cursor_pos(strlen(UTIL_TERM_get_cli_buffer(0)));
  }
  else if (strcmp(gContext->tCsi, UTIL_TERM_KEY_RG) == 0)
  {
    if (gContext->iPosCursor < strlen(UTIL_TERM_get_cli_buffer(0)))
    {
      cKeySupport.set_cursor_pos(gContext->iPosCursor + 1U);
    }
    else
    {
      UTIL_TERM_puts(UTIL_TERM_KEY_BEL);
    }
  }
  else if (strcmp(gContext->tCsi, UTIL_TERM_KEY_LF) == 0)
  {
    if (gContext->iPosCursor)
    {
      cKeySupport.set_cursor_pos(gContext->iPosCursor - 1U);
    }
    else
    {
      UTIL_TERM_puts(UTIL_TERM_KEY_BEL);
    }
  }
  else if (strcmp(gContext->tCsi, UTIL_TERM_KEY_UP) == 0)
  {
    if (gContext->iHistory < gContext->szHistory)
    {
      gContext->iHistory++;
      strcpy(UTIL_TERM_get_cli_buffer(0), UTIL_TERM_get_cli_buffer(gContext->iHistory));
      UTIL_TERM_puts("\x1B[M\x1B[1G");
      UTIL_TERM_puts(UTIL_TERM_PROMPT_PROLOGUE);
      UTIL_TERM_puts(UTIL_TERM_get_cli_buffer(0));
      gContext->iPosCursor = strlen(UTIL_TERM_get_cli_buffer(0));
      cKeySupport.set_cursor_pos(gContext->iPosCursor);
    }
    else
    {
      UTIL_TERM_puts(UTIL_TERM_KEY_BEL);
    }
  }
  else if (strcmp(gContext->tCsi, UTIL_TERM_KEY_DN) == 0)
  {
    if (gContext->iHistory >= 1U)
    {
      gContext->iHistory--;
      strcpy(UTIL_TERM_get_cli_buffer(0), UTIL_TERM_get_cli_buffer(gContext->iHistory));
      UTIL_TERM_puts("\x1B[M\x1B[1G");
      UTIL_TERM_puts(UTIL_TERM_PROMPT_PROLOGUE);
      UTIL_TERM_puts(UTIL_TERM_get_cli_buffer(0));
      gContext->iPosCursor = strlen(UTIL_TERM_get_cli_buffer(0));
      cKeySupport.set_cursor_pos(gContext->iPosCursor);
    }
    else
    {
      UTIL_TERM_puts(UTIL_TERM_KEY_BEL);
    }
  }
  else
  {
    bDone = false;
  }

  return bDone;
}


/* Overload key interface */
static const key_support_cb cKeySupport =
{
  .maxHistory           = UTIL_TERM_SIZE_HISTORY,
  .is_key_del_char      = s_csi_is_key_del_char,
  .set_cursor_pos       = s_csi_set_cursor_pos,
  .add_char_at_position = s_csi_add_char_at_position,
  .is_key_back          = s_csi_is_key_back,
  .is_key_csi           = s_csi_check_key,
};
#else
/**
 * @brief key  not supported
 *
 * @param theChar
 * @return true
 * @return false
 */
static bool s_key_not_supported(char theChar)
{
  return false;
}


/**
 * @brief set the current cursor position
 *
 * @param pos
 */
static void s_set_cursor_pos(uint32_t pos)
{
  gContext->iPosCursor = pos;
}


/**
 * @brief set the current cursor position
 *
 * @param pos
 */
static void s_add_char_at_position(char theChar)
{
  if (gContext->iPosCursor < (gContext->lenBuffer - 1U))
  {
    /* if the char is ascii, add it to the Cli buffer */
    if ((theChar >= ' ') && (theChar <= (char)127U))
    {
      uint32_t lenMove = gContext->lenBuffer - gContext->iPosCursor - 1;
      memmove(&UTIL_TERM_get_cli_buffer(0)[gContext->iPosCursor + 1], &UTIL_TERM_get_cli_buffer(0)[gContext->iPosCursor], lenMove);
      UTIL_TERM_get_cli_buffer(0)[gContext->iPosCursor] = theChar;
      gContext->iPosCursor++;
      char tChar[2] = {theChar, '\0'};
      UTIL_TERM_puts(tChar);
    }
  }
}


/**
 * @brief Check the key BACK and do the action
 *
 * @param theChar
 * @return true
 * @return false
 */
static bool s_is_key_back(char theChar)
{
  bool bDone = false;
  if ((gContext->bCliEnable == true) && (theChar == UTIL_TERM_KEY_BACK))
  {
    /* check the backspace and remove the last char */
    if (gContext->iPosCursor)
    {
      uint32_t lenLine = strlen(UTIL_TERM_get_cli_buffer(0)) + 1; /* +1 for the 0 */
      gContext->iPosCursor--;                                     /* remove previous char */
      memmove(UTIL_TERM_get_cli_buffer(0) + gContext->iPosCursor, UTIL_TERM_get_cli_buffer(0) + gContext->iPosCursor + 1, lenLine - gContext->iPosCursor - 1);
      UTIL_TERM_puts("\x8 \x8");
    }
    bDone = true;
  }
  return bDone;
}


/* Overload key interface */
static const key_support_cb cKeySupport =
{
  .maxHistory           = 1,
  .is_key_del_char      = s_key_not_supported,
  .set_cursor_pos       = s_set_cursor_pos,
  .add_char_at_position = s_add_char_at_position,
  .is_key_back          = s_is_key_back,
  .is_key_csi           = NULL,
};


#endif


/**
 * @brief Check and manage CSI keys
 *
 * @param theChar
 * @return true
 * @return false
 */
static bool s_is_key_csi(char theChar)
{
  bool bDone = false;

  if ((gContext->bEsc == true) && (gContext->bCliEnable == true))
  {
    /* if too big, cancel the sequence */
    if (gContext->iIndexCsi > (uint8_t)(sizeof(gContext->tCsi) - 1U))
    {
      gContext->bEsc = false;
      bDone          = true;
    }
    /* accumulate to the buffer */
    gContext->tCsi[gContext->iIndexCsi++] = theChar;
    gContext->tCsi[gContext->iIndexCsi]   = '\0';
    /* read the Csi esc until the end */
    if ((theChar == '[') || (theChar == ';') || (isdigit((int)theChar) != 0)) /*cstat !MISRAC2012-Dir-4.11_h false positive, in this context theChar is an 8 bits and cannot be > 255 after the cast  */
    {
      bDone = true;
    }
    else
    {
      if (cKeySupport.is_key_csi)
      {
        cKeySupport.is_key_csi();
      }
      /* no interception of a csi key, ignore it */
      bDone = true;
      gContext->iIndexCsi = 0;
      gContext->bEsc      = false;

