stm32-hotspot/STM32WBA-Advanced-BLE-Broadcast-Speaker/Utilities/Terminal/stm32_term.c
    }
  }
  if ((theChar == UTIL_TERM_KEY_ESC) && (gContext->bCliEnable))
  {
    gContext->iIndexCsi = 0;
    gContext->bEsc      = true;
    bDone               = true;
  }
  return bDone;
}


/**
 * @brief Add  the current line to the history
 *
 */
static void s_add_history(void)
{
  if (strlen(UTIL_TERM_get_cli_buffer(0)) != 0U)
  {
    /* scroll history */
    if ((gContext->szHistory + 1U) < gContext->maxHistory)
    {
      gContext->szHistory++;
    }
    uint32_t szMove = gContext->lenBuffer * gContext->szHistory;
    memmove(UTIL_TERM_get_cli_buffer(1), UTIL_TERM_get_cli_buffer(0), szMove);
  }
  /* reset ESC and history */
  gContext->iHistory    = 0;
  gContext->iIndexCsi = 0;
  gContext->bEsc        = false;
}


/**
 * @brief Reset the current line
 *
 */
static void s_reset_cursor(void)
{
  gContext->iPosCursor           = 0;
  UTIL_TERM_get_cli_buffer(0)[0] = '\0';
}


/**
 * @brief Check if we enter or exit from the CLI state
 *
 * @param theChar
 * @return true
 * @return false
 */
static bool s_is_key_enter_exit_cli(char theChar)
{
  bool bDone = false;
  /* Check enter and exit from the cli */
  if (((theChar == '\r') || (theChar == '\n')))
  {
    UTIL_TERM_puts("\n"); /* echo on the console  */
    if (gContext->bCliEnable)
    {
      /* The CLI was enabled, it is an end of line */
      s_enable_cli(0U);
      /*
          default, logs are allowed in the command
          if a command needs to receive data from the serial
          it must call UTIL_TERM_Mute(UTIL_TERM_MUTE_LOG_FORCE_OFF;
          to prevent transmission issue
      */

      UTIL_TERM_Mute(UTIL_TERM_MUTE_LOG_FORCE_ON);
      s_add_history();
      s_do_line_cmd(UTIL_TERM_get_cli_buffer(0));
      UTIL_TERM_puts("\n");
    }
    else
    {
      /* The LOG is disabled, we enter in the prompt CLI mode  */
      UTIL_TERM_Mute(UTIL_TERM_MUTE_LOG_FORCE_OFF);
      s_enable_cli(1U);
      UTIL_TERM_puts(UTIL_TERM_PROMPT_PROLOGUE);
    }
    s_reset_cursor();
    bDone = true;
  }
  return bDone;
}


/**
 * @brief Check if we exit from the CLI
 *
 * @param theChar
 * @return true
 * @return false
 */
static bool s_is_key_escape(char theChar)
{
  bool bDone = false;
  if ((gContext->bCliEnable == true) && (theChar == UTIL_TERM_KEY_ESC_KEYBOARD))
  {
    /* cancel edition  */
    UTIL_TERM_puts("\n");
    s_reset_cursor();
    UTIL_TERM_Mute(UTIL_TERM_MUTE_LOG_FORCE_ON);
    s_enable_cli(0U);
    bDone = true;
  }
  return bDone;
}


/**
 * @brief Create line buffers according to the history depth
 *
 * @return uint8_t
 */
static int32_t s_create_line_buffer(void)
{
  int32_t error        = UTIL_ERROR_NONE;
  gContext->szHistory  = 0;
  gContext->iHistory   = 0;
  gContext->lenBuffer  = UTIL_TERM_CLI_SIZE;
  gContext->maxHistory = cKeySupport.maxHistory;
  gContext->pBuffer    = s_realloc(NULL, gContext->lenBuffer * gContext->maxHistory);
  if (gContext->pBuffer == NULL)
  {
    error = UTIL_ERROR;
  }

  if (error == UTIL_ERROR_NONE)
  {
    memset(gContext->pBuffer, 0, gContext->lenBuffer * gContext->maxHistory);
  }
  return error;
}


/**
* @brief returns the current buffer
*
*/
static int32_t s_delete_line_buffer(void)
{
  int32_t error = UTIL_ERROR_NONE;
  if (gContext->pBuffer)
  {
    s_free(gContext->pBuffer); /*cstat !MISRAC2012-Dir-4.13_h the pointer is allocated in the class constructor, it is a false positive */
    gContext->pBuffer = NULL;
  }
  return error;
}


/**
* @brief Starts the RX DMA pump
*
*/
static int32_t s_start_rx(void)
{
  gContext->pDmaCurrent     = gContext->pDmaBuffer;
  gContext->iRxBufferOffset = 0;
  return UTIL_UART_StartRxDmaToIdle(gContext->pDmaBuffer, gContext->szDmaBlk);
}


/**
* @brief terminal init
*
*/
int32_t UTIL_TERM_create(void)
{
  int32_t error = UTIL_ERROR_NONE;

  /* cycles measure initialization */
  UTIL_TERM_cycleMeasure_Init();
  UTIL_TERM_cycleMeasure_Reset();
  error = UTIL_TERM_TASK_create();

  UTIL_TERM_Mute(UTIL_TERM_MUTE_LOG_FORCE_ON);
  s_enable_cli(0U);
  if (error == UTIL_ERROR_NONE)
  {
    gContext->bInitDone                     = true;
    gContext->szDmaBlk                      = UTIL_UART_RX_BUFFER_SIZE;
    gContext->pHdleUart->RxHalfCpltCallback = s_dma_uart_rx_half_cb;
    gContext->pHdleUart->RxCpltCallback     = s_dma_uart_rx_cpl_cb;
    gContext->pHdleUart->RxEventCallback    = s_dma_uart_event_cb;
    error = s_start_rx();
  }

  if (error == UTIL_ERROR_NONE)
  {
    error = s_create_line_buffer();
  }

  if (error == UTIL_ERROR_NONE)
  {
    UTIL_TERM_Initialized(gContext);
    UTIL_TERM_Enable(true);
  }
  else
  {
    UTIL_TERM_printf("UTIL_TERM_TASK_create error\n");
    if (error == UTIL_ERROR_ALLOC)
    {
      UTIL_TERM_printf("ERROR! UART RX size two big. Please increase DMA UART buffer\n");
    }
  }

  return error;
}


/**
* @brief this weak function provides the opportunity record incoming data
* @param gContext  Term instance
*
*/
__weak void UTIL_TERM_Initialized(UTIL_TERM_t *gContext)
{
}


/**
* @brief this weak function provides the opportunity to record the terminal console in
*
*/
__weak void UTIL_TERM_parse_in_recorder(uint8_t *pBuffer, uint32_t szBuffer)
{
}


/**
* @brief this weak function provides the opportunity to record the terminal console out
*
*/
__weak void UTIL_TERM_parse_out_recorder(uint8_t *pBuffer, uint32_t szBuffer)
{
}


/**
* @brief return true if the terminal is muted
*
*/
bool UTIL_TERM_IsLogMuted(void)
{
  return UTIL_UART_IsLogMuted();
}


void UTIL_TERM_Mute(UTIL_TERM_MUTE_t state)
{
  switch (state)
  {
    default:
    case UTIL_TERM_MUTE_LOG_FORCE_ON:
      UTIL_UART_Mute(UTIL_UART_MUTE_FORCE_ON);
      break;
    case UTIL_TERM_MUTE_LOG_FORCE_OFF:
      UTIL_UART_Mute(UTIL_UART_MUTE_FORCE_OFF);
      break;
    case UTIL_TERM_MUTE_RX_ON:
      gContext->rxMute = false;
      break;
    case UTIL_TERM_MUTE_RX_OFF:
      gContext->rxMute = true;
      break;
  }
}


/**
* @brief terminal ending & deinit
*
*/
int32_t UTIL_TERM_delete(void)
{
  /* Stop Rx processing*/
  s_enable_cli(TRUE);
  s_delete_line_buffer();

  UTIL_TERM_TASK_terminate();
  /* Delete rx buffer*/
  s_free(gContext);

  return UTIL_ERROR_NONE;
}


/**
* @brief returns the context
*
*/
UTIL_TERM_t *UTIL_TERM_get_context(void)
{
  return gContext;
}


/**
* @brief add a listener to the task idle state
* @param cb idle state callback
*/
uint8_t UTIL_TERM_add_Idle_listener(UTIL_TERM_IDLE_CB cb)
{
  uint8_t result = FALSE;
  if (gContext->szIdleCb < UTIL_TERM_IDLE_CB_MAX)
  {
    gContext->tIdleCb[gContext->szIdleCb] = cb;
    gContext->szIdleCb++;
    result = TRUE;
  }
  return result;
}


/**
* @brief Calls listener to idle when there is no activity
*
* @param pCookie the opaque parameter
* @return error
*/
static void UTIL_TERM_Idle(void)
{
  for (uint8_t indexListener = 0U; indexListener < gContext->szIdleCb; indexListener++)
  {
    gContext->tIdleCb[indexListener]();
  }
}


/**
* @brief Uart Rx configuration setting
*
* @param huart the uart instance
*/
int32_t UTIL_TERM_set_uart_rx(UART_HandleTypeDef *const huart)
{
  int32_t error = UTIL_ERROR_NONE;

  gContext = s_realloc(NULL, sizeof(*gContext));
  if (gContext == NULL)
  {
    UTIL_TERM_printf("gContext allocation error\n");
    error = UTIL_ERROR_ALLOC;
  }
  if (error == UTIL_ERROR_NONE)
  {
    memset(gContext, 0, sizeof(*gContext));
    gContext->pHdleUart                = huart;
    gContext->pHdleUart->ErrorCallback = s_rx_error_cb;
    gContext->hRxDma                   = huart->hdmarx;
    gContext->pDmaBuffer               = UTIL_UART_GetRxBuffer();
    if (gContext->pDmaBuffer == NULL)
    {
      UTIL_TERM_printf("gContext->pDmaBuffer allocation error\n");
      error = UTIL_ERROR_ALLOC;
    }
  }

  return error;
}


/**
* @brief Put a string in the terminal
*
*/
void UTIL_TERM_puts(char *const pString)
{
  UTIL_UART_fputs_force(pString);
  UTIL_TERM_parse_out_recorder((uint8_t *)pString, strlen(pString));
}


/**
* @brief Direct terminal printf
* @param printf format and arguments.
* @retval None.
*/
void UTIL_TERM_printf(char *pFormat, ...)
{
  va_list args;
  va_start(args, pFormat);
  if (vsnprintf(gContext->tFormat, sizeof(gContext->tFormat), pFormat, args) > 0)
  {
    UTIL_TERM_puts(gContext->tFormat);
  }
  va_end(args);
}


/**
* @brief Direct terminal printf with ending carriage-return
* @param printf format and arguments.
* @retval None.
*/
void UTIL_TERM_printf_cr(char *pFormat, ...)
{
  va_list args;
  va_start(args, pFormat);
  if (vsnprintf(gContext->tFormat, sizeof(gContext->tFormat), pFormat, args) > 0)
  {
    UTIL_TERM_puts(gContext->tFormat);
  }
  UTIL_TERM_puts("\n");
  va_end(args);
}


/**
* @brief print a text even if the mute is set, mainly used for errors
* @param printf format and arguments.
* @retval None.
*/
void UTIL_TERM_printf_forced(char *pFormat, ...)
{
  va_list args;
  va_start(args, pFormat);
  UTIL_TERM_Mute(UTIL_TERM_MUTE_LOG_FORCE_ON);
  if (vsnprintf(gContext->tFormat, sizeof(gContext->tFormat), pFormat, args) > 0)
  {
    UTIL_TERM_puts(gContext->tFormat);
  }
  va_end(args);
}


/**
* @brief print a text with ending carriage-return even if the mute is set, mainly used for errors
* @param printf format and arguments.
* @retval None.
*/
void UTIL_TERM_printf_forced_cr(char *pFormat, ...)
{
  va_list args;
  va_start(args, pFormat);
  UTIL_TERM_Mute(UTIL_TERM_MUTE_LOG_FORCE_ON);
  if (vsnprintf(gContext->tFormat, sizeof(gContext->tFormat), pFormat, args) > 0)
  {
    UTIL_TERM_puts(gContext->tFormat);
  }
  UTIL_TERM_puts("\n");
  va_end(args);
}


/* we try to detect  an isolated ESC that doesn't exist in terminal VT100, but it it sent as an unique ESC keyboard by them
   we use this key to exit the Cli mode
   if the buffer has an unique ESC we translate the char to a pseudo code handling the key ESC of the keyboard
   if a sequence ESC is not followed by '[' that is the open Sequence, we translate the key too
  */
static void UTIL_TERM_TASK_translate_esc(uint8_t *pBuffer, uint32_t szCopy)
{
  if (gContext->bCliEnable)
  {
    if (pBuffer[0] == (uint8_t)UTIL_TERM_KEY_ESC)
    {
      if ((szCopy == 1U) || ((szCopy >= 2U) && (pBuffer[1] != (uint8_t)'[')))
      {
        *pBuffer = (uint8_t)UTIL_TERM_KEY_ESC_KEYBOARD;
      }
    }
  }
}


static bool UTIL_TERM_parse_key_action(char theChar)
{
  bool bDone = s_is_key_csi(theChar);

  if (bDone == false)
  {
    bDone = s_is_key_escape(theChar);
  }
  if (bDone == false)
  {
    bDone = s_is_key_enter_exit_cli(theChar);
  }

  if (bDone == false)
  {
    bDone = cKeySupport.is_key_del_char(theChar);
  }

  /* check the back space to delete a char */
  if (bDone == false)
  {
    bDone = cKeySupport.is_key_back(theChar);
  }
  return bDone;
}


/**
* @brief Add a char in the buffer or manage it
*
*/
void UTIL_TERM_parse_char(char const theChar)
{
  bool bDone = UTIL_TERM_parse_key_action(theChar);
  if (gContext->bCliEnable && (bDone == false))
  {
    cKeySupport.add_char_at_position(theChar);
  }
}


/**
* @brief MUST be defined by user ; must return pointer on custom commands
*
* @param argc  num args
* @param argv  args list
*/
__weak UTIL_TERM_cmd_str_entry_t const *UTIL_TERM_getCustomCommands(void)
{
  UTIL_TERM_printf_cr("ERROR! calling the weak function UTIL_TERM_getCustomCommands; it must be user defined");
  return NULL;
}


/**
* @brief Display terminal help
*
* @param argc  num args
* @param argv  args list
*/
void UTIL_TERM_cmd_help(int argc, char *argv[])
{
  UTIL_TERM_cmd_str_entry_t const *pCmds = UTIL_TERM_getCustomCommands();
  for (int cptCmd = 0; pCmds[cptCmd].name != NULL; cptCmd++)
  {
    UTIL_TERM_printf_cr("%-018s : %-40s : %s", pCmds[cptCmd].name, (pCmds[cptCmd].params == NULL) ? "" : pCmds[cptCmd].params, pCmds[cptCmd].comments);
  }
}


/**
* @brief Receive a raw file from the terminal
*
* @param pBuffer the buffer
* @param szBuffer the buffer size
*/
int32_t UTIL_TERM_receive_raw_file(uint8_t *pBuffer, uint32_t const szBuffer, uint32_t const syncTmo, uint32_t *pOutSzPaste)
{
  int32_t  ret         = UTIL_ERROR_NONE;
  uint32_t maxSyncTime = syncTmo / UTIL_TERM_SYNC_TIMEOUT; /* sync time*/
  uint32_t szPaste     = 0;
  uint32_t szBlock     = 0;
  bool     bContinue   = true;
  size_t   szRemaining;

