stm32-hotspot/STM32WBA-Advanced-BLE-Broadcast-Speaker/Utilities/Terminal/stm32_term.c
  /* wait a transmission, log off */
  UTIL_TERM_Mute(UTIL_TERM_MUTE_LOG_FORCE_OFF);

  if (pOutSzPaste)
  {
    *pOutSzPaste = 0;
  }
  gContext->bRawTransfer = true;
  if (ret == UTIL_ERROR_NONE)
  {
    ret = UTIL_ERROR_TIMEOUT;
    /* wait for the transmission start */

    while ((maxSyncTime != 0U) && (ret == UTIL_ERROR_TIMEOUT))
    {
      ret = UTIL_TERM_TASK_wait_data(pBuffer, 1, UTIL_TERM_SYNC_TIMEOUT, &szRemaining);
      if (ret != UTIL_ERROR_TIMEOUT)
      {
        /* 1 byte read, the transmission is started */
        szPaste++;
        pBuffer++;
        break;
      }
      /* send an echo */
      UTIL_TERM_puts("C");
    }
    maxSyncTime--;
  }

  if (ret == UTIL_ERROR_NONE)
  {
    if (maxSyncTime == 0U)
    {
      /* timeout , exit */
      ret = UTIL_ERROR_TIMEOUT;
    }
  }

  if (ret == UTIL_ERROR_NONE)
  {
    /* Now receive the remaining until no char during x  ms that mark the end of the file */
    bContinue = true;
    while (bContinue)
    {
      ret = UTIL_TERM_TASK_wait_data(pBuffer, 1, UTIL_TERM_TIMEOUT_EOF, &szRemaining);
      if (ret == UTIL_ERROR_NONE)
      {
        szPaste++;
        pBuffer++;
        /* check the buffer limit */
        if ((szPaste + szBlock + 1U) > szBuffer)
        {
          ret       = UTIL_ERROR_ALLOC;
          bContinue = false;
        }
      }
      else
      {
        if (ret == UTIL_ERROR_TIMEOUT)
        {
          ret       = UTIL_ERROR_NONE;
          bContinue = false;
        }
      }
    }
  }

  if (pOutSzPaste)
  {
    *pOutSzPaste = szPaste;
  }
  gContext->bRawTransfer = false;
  UTIL_TERM_Mute(UTIL_TERM_MUTE_LOG_FORCE_ON);

  return ret;
}


/**
* @brief Reset board
*
* @param argc  num args
* @param argv  args list
*/
void UTIL_TERM_cmd_reboot(int argc, char *argv[])
{
  if (argc != 1)
  {
    UTIL_TERM_printf("Error:Wrong Command parameters\n");
  }
  else
  {
    UTIL_TERM_printf("reboot board\n");
    NVIC_SystemReset();
  }
}


/**
* @brief Add the char to the Receive buffer, realloc the buffer if needed
*
*/
static int32_t UTIL_TERM_add_buffer(uint8_t incoming, char_t **ppBuffer, uint32_t *pcountBuffer, uint32_t *pSzBuffer)
{
  char_t *pBuffer = *ppBuffer;

  if ((*pcountBuffer) >= (*pSzBuffer))
  {
    *pSzBuffer = (*pcountBuffer) + UTIL_TERM_BUFFER_GROW;
    char_t *pNewBuff = s_realloc(pBuffer, *pSzBuffer);
    if (pNewBuff == NULL)
    {
      s_free(pBuffer);
      pBuffer = NULL;
      return UTIL_ERROR_ALLOC;
    }
    pBuffer = pNewBuff;
  }

  pBuffer[*pcountBuffer] = (char_t)incoming;
  (*pcountBuffer)++;
  *ppBuffer = pBuffer;

  return UTIL_ERROR_NONE;
}


/**
* @brief Receive a raw file from the terminal
*
* @param pBuffer the buffer
* @param szBuffer the buffer size
*/
int32_t UTIL_TERM_receive_file(char_t **pFileBuffer, uint32_t *pSzFileBuffer, uint32_t const syncTmo)
{
  int32_t  ret          = UTIL_ERROR_NONE;
  uint32_t szBuffer     = 0U;
  uint32_t countBuffer  = 0U;
  char_t  *pBuffer      = NULL;
  uint32_t maxSyncTime  = syncTmo / UTIL_TERM_SYNC_TIMEOUT; /* sync time*/
  bool     bContinue    = true;
  size_t   szRemaining  = 0UL;
  uint8_t  incomingChar = 0U;

  if ((pFileBuffer == NULL) || (pSzFileBuffer == NULL))
  {
    return UTIL_ERROR;
  }
  *pFileBuffer   = NULL;
  *pSzFileBuffer = 0UL;

  /* wait a transmission, log off */
  UTIL_TERM_Mute(UTIL_TERM_MUTE_LOG_FORCE_OFF);

  gContext->bRawTransfer = true;
  ret = UTIL_ERROR_TIMEOUT;
  /* wait for the transmission start (at least 1 char) */
  while ((maxSyncTime != 0U) && (ret == UTIL_ERROR_TIMEOUT))
  {
    ret = UTIL_TERM_TASK_wait_data(&incomingChar, 1, UTIL_TERM_SYNC_TIMEOUT, &szRemaining);
    if (ret != UTIL_ERROR_TIMEOUT)
    {
      break;
    }
    maxSyncTime--;
  }

  if (ret == UTIL_ERROR_NONE)
  {
    if (maxSyncTime == 0U)
    {
      /* timeout , exit */
      ret = UTIL_ERROR_TIMEOUT;
    }
  }

  if (ret == UTIL_ERROR_NONE)
  {
    /* the char read during the sync must be added to the stream  */
    ret = UTIL_TERM_add_buffer(incomingChar, &pBuffer, &countBuffer, &szBuffer);
  }

  if (ret == UTIL_ERROR_NONE)
  {
    bContinue = true;
    /* Now receive the remaining until timeout that mark the end of the file or the max size reached*/
    while (bContinue)
    {
      ret = UTIL_TERM_TASK_wait_data(&incomingChar, 1, UTIL_TERM_TIMEOUT_EOF, &szRemaining);
      if (ret == UTIL_ERROR_NONE)
      {
        if (incomingChar == UTIL_CHAR_EOF)
        {
          /* max char reached, stop the stream */
          ret       = UTIL_ERROR_NONE;
          bContinue = false;
          break;
        }

        ret       = UTIL_TERM_add_buffer(incomingChar, &pBuffer, &countBuffer, &szBuffer);
        bContinue = (ret == UTIL_ERROR_NONE);
      }
      else
      {
        if (ret == UTIL_ERROR_TIMEOUT)
        {
          ret       = UTIL_ERROR_NONE;
          bContinue = false;
        }
      }
    }
  }

  if (ret == UTIL_ERROR_NONE)
  {
    UTIL_TERM_add_buffer(0, &pBuffer, &countBuffer, &szBuffer);
    (*pFileBuffer)   = pBuffer;
    (*pSzFileBuffer) = countBuffer - 1UL;
  }

  gContext->bRawTransfer = false;
  UTIL_TERM_Mute(UTIL_TERM_MUTE_LOG_FORCE_ON);

  return ret;
}


/* Static Functions Definition ------------------------------------------------------*/

/**
* @brief Look for an command instance
*
* @param command the command name
* @return UTIL_TERM_cmd_str_entry_t*  the command instance
*/
static const UTIL_TERM_cmd_str_entry_t *s_find_entry(char *command)
{
  UTIL_TERM_cmd_str_entry_t const *pCmd = UTIL_TERM_getCustomCommands();

  while (pCmd != NULL)
  {
    if (pCmd->name == NULL)
    {
      /* end of custom commands => command not found */
      pCmd = NULL;
    }
    else if (strcmp(command, pCmd->name) == 0)
    {
      /* command found */
      break;
    }
    else
    {
      /* next command */
      pCmd++;
    }
  }

  return pCmd;
}


static bool s_search_end_of_word(char **const ppLine, const char end_of_word_char)
{
  char *pLine = *ppLine;
  bool  eol   = false;

  while (*pLine != end_of_word_char)
  {
    if ((*pLine == '\0') || (*pLine == '\r') || (*pLine == '\n'))
    {
      eol = true;
      break;
    }
    pLine++;
  }
  *pLine = '\0'; // set end of word
  pLine++;       // skip end_of_word_char or eol (already replaced with end of word: see line above)
  *ppLine = pLine;

