stm32-hotspot/STM32WBA-Advanced-BLE-Broadcast-Speaker/Utilities/Terminal/stm32_term.c
  return eol;
}


static void s_do_line_cmd(char *pLine)
{
  char    *tListWord[UTIL_TERM_MAX_PARAM];
  uint32_t wordcpt = 0U;
  bool     eol     = false;

  while ((!eol) && (wordcpt < UTIL_TERM_MAX_PARAM))
  {
    /* Eliminate starting spaces */
    while (*pLine == ' ')
    {
      pLine++;
    }

    if (*pLine == '\0')
    {
      eol = true;
    }
    else if (*pLine == '"')
    {
      // word starting with '"'
      pLine++; // skip starting '"'
      tListWord[wordcpt] = pLine;
      wordcpt++;
      eol = s_search_end_of_word(&pLine, '"');
      if (!eol) // not eol => ending '"' found => is there an eol after ending '"' ?
      {
        eol = (*pLine == '\0') || (*pLine == '\r') || (*pLine == '\n');
      }
    }
    else
    {
      // word not starting with "'"
      tListWord[wordcpt] = pLine;
      wordcpt++;
      eol = s_search_end_of_word(&pLine, ' ');
    }
  }

  if (wordcpt > 0U)
  {
    UTIL_TERM_cmd_str_entry_t const *pEntry = s_find_entry(tListWord[0]);

    if (pEntry == NULL)
    {
      UTIL_TERM_printf("Command \"%s\" not found\n", tListWord[0]);
    }
    else
    {
      pEntry->command(wordcpt, tListWord);
    }
  }
}


/**
* @brief Uart error callback
*
* @param pHdleUart the uart instance
*/
static void s_rx_error_cb(UART_HandleTypeDef *pHdleUart)
{
  if (gContext->bInitDone)
  {
    if (pHdleUart == gContext->pHdleUart)
    {
      /*  Just signal it for debug */
      UTIL_TERM_printf_cr("UART Error: %d", pHdleUart->ErrorCode);
      /* on error the dma is stopped, so, restart it */
      s_start_rx();

    }
  }
}


/**
* @brief Inject a payload in the Rx queue
*
**/

int32_t UTIL_TERM_inject_rx(uint8_t *pBuffer, uint32_t const szBuffer)
{
  return UTIL_TERM_TASK_send_data(pBuffer, szBuffer);
}


/* @brief Inject a payload in the Rx queue
*
**/
static void s_dma_uart_inject(uint8_t *pData, uint32_t szData)
{
  if (gContext->rxMute == 0U)
  {
    UTIL_TERM_TASK_translate_esc(pData, szData);
    UTIL_TERM_TASK_send_data_from_isr(pData, szData);
  }
  UTIL_TERM_parse_in_recorder(pData, szData);
}


/**
* @brief Signal a full DMA
*
* @param pHdleUart
**/
static void s_dma_uart_rx_cpl_cb(struct __UART_HandleTypeDef *huart)
{
  if (gContext->bInitDone)
  {
    uint8_t  *pBuffer = gContext->pDmaCurrent + gContext->iRxBufferOffset;
    uint32_t szBuffer = ((uint32_t)gContext->szDmaBlk / 2U) - gContext->iRxBufferOffset;
    if (szBuffer)
    {
      s_dma_uart_inject(pBuffer, szBuffer);
    }
    gContext->iRxBufferOffset = 0;
    gContext->pDmaCurrent     = gContext->pDmaBuffer;
  }
}


/**
* @brief Signal a Half DMA
*
* @param pHdleUart
**/
static void s_dma_uart_rx_half_cb(struct __UART_HandleTypeDef *huart)
{
  if (gContext->bInitDone)
  {
    uint8_t   *pBuffer = gContext->pDmaCurrent + gContext->iRxBufferOffset;
    uint32_t szBuffer = ((uint32_t)gContext->szDmaBlk / 2U) - gContext->iRxBufferOffset;
    if (szBuffer)
    {
      s_dma_uart_inject(pBuffer, szBuffer);
    }
    gContext->pDmaCurrent     = gContext->pDmaBuffer + (gContext->szDmaBlk / 2U);
    gContext->iRxBufferOffset = 0U;
  }
}


/**
* @brief Signal a full DMA or IDLE state
*
* @param pHdleUart
* @param position position  in the full buffer
**/
static void s_dma_uart_event_cb(struct __UART_HandleTypeDef *huart, uint16_t position)
{
  if (gContext->bInitDone)
  {
    /* compute the position in the circular buffer */

    if (position  >= (gContext->szDmaBlk / 2U))
    {
      /* if the position is > sz/2, the target is in second part of the buffer */
      position -= gContext->szDmaBlk / 2U;
    }

    uint8_t *pBuffer = gContext->pDmaCurrent + gContext->iRxBufferOffset;;
    /* compute the size produced since the last dma it our UART Idle IT */
    uint32_t szBuffer = position - gContext->iRxBufferOffset;
    if (szBuffer)
    {
      /* if there are data, fill it */
      s_dma_uart_inject(pBuffer, szBuffer);
      gContext->iRxBufferOffset += szBuffer;
    }
  }
}


/**
* @brief enable cli
*
* @param bEnable  true or false
*/
static void s_enable_cli(uint8_t bEnable)
{
  gContext->bCliEnable = (bool)bEnable;
}


/**
* @brief Command processing thread
*
* @return error
*/
int32_t UTIL_TERM_process(void)
{
  int32_t error = UTIL_ERROR_NONE;

  if (gContext->bTerminalEnabled)
  {
    bool    done = false;
    uint8_t data;
    size_t  szRemaining;

    if (gContext->bRawTransfer == false)
    {
      error = UTIL_TERM_TASK_wait_data(&data, 1UL, UTIL_TERM_IDLE_TIMEOUT, &szRemaining);
      if (error == UTIL_ERROR_NONE)
      {
        UTIL_TERM_cycleMeasure_Start();
        UTIL_TERM_parse_char((char)data);
        UTIL_TERM_cycleMeasure_Stop();
        done = true;
      }
    }
    if (done == false)
    {
      UTIL_TERM_Idle();
    }
  }
  else
  {
    error = UTIL_ERROR;
  }

  return error;
}


/**
* @brief Enable the terminal
*
* @param bEnable true or false
* @return error
*/
int32_t UTIL_TERM_Enable(bool bEnable)
{
  int32_t error = UTIL_ERROR;
  if (gContext)
  {
    gContext->bTerminalEnabled = bEnable;
    error                      = UTIL_ERROR_NONE;
  }
  return error;
}
